---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.MajorLapSpliceLength
source: html/df89be76-3196-4b46-f7fd-7fd70c5d07b7.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.MajorLapSpliceLength Property

The fabric lap splice length in the fabric distribution in the major direction.

## Syntax (C#)
```csharp
public double MajorLapSpliceLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: majorLapSpliceLength is greater than the half of the overall length.